app/Views/web/index.php

			<div class="row">

				<?php
					$services = $db->table('service')->where(["status"=>1,])->get()->getResult();
---
SELECT *
FROM `service`
WHERE `status` = 1