app/Views/web/service-detail.php

										<div class="sidebar-service-list">
											<ul>
												<?php
													$services = $db->table('service')->where(["status"=>1,])->get()->getResult();
---
SELECT *
FROM `service`
WHERE `status` = 1